In [1]:
mydict = {'Name': 'Akbar', 'Age': 24, 'Job Description': ['Junior Data Scientist']}

In [2]:
mydict

{'Name': 'Akbar', 'Age': 24, 'Job Description': ['Junior Data Scientist']}

In [3]:
mydict['Age']

24

In [4]:
mydict['Job Description']

['Junior Data Scientist']

In [7]:
(lambda x,y,z: (x+y) **z)(5,5,5)

100000

In [8]:
def func(x,y,z):
    
    return (x+y) **z

In [9]:
func(5,5,5)

100000

In [10]:
a_list = [5,6,4,6,-2,0]
new_list = [c**2 for c in a_list if c>0 ]
print(new_list)

[25, 36, 16, 36]

In [14]:
name = 'akbar'
age = 24

print('my name is {} and I amd {} years old'.format(name,age))

my name is akbar and I amd 24 years old

In [15]:
l = [5,6,7,['hello',True]]

In [16]:
l.append(7860)

In [17]:
l

[5, 6, 7, ['hello', True], 7860]

In [18]:
l.pop()

7860

In [19]:
l

[5, 6, 7, ['hello', True]]

In [20]:
l[3][0]

'hello'

In [21]:
print(l[3][0])

hello

In [25]:
{2,2,2,2,2,4,5,6,7,5,6,5,6,5,6}

{2, 4, 5, 6, 7}

In [26]:
s1 = {2,2,2,2,2,4,5,6,7,5,6,5,6,5,6}

In [27]:
s1

{2, 4, 5, 6, 7}

In [91]:
a_list = [1,2,3,4,5]

for item in a_list:
    if item <= 4:
        print((item**3))

1
8
27
64

In [92]:
def return_cube(b_list):
    
    for item in b_list:
        if item <= 4:

            return item **3

In [93]:
print(b_list)
return_cube(b_list)

NameError: name 'b_list' is not defined

In [52]:
x = [1,2,3,4,5]

In [94]:
def myfunc(parameter = 'default'):
    print(parameter)

In [95]:
myfunc()

default

In [96]:
myfunc('hello')

hello

In [97]:
myfunc()

default

In [98]:
def times2(var):
    return var **2

In [99]:
times2(2)

4

In [100]:
lambda var: var **2

In [101]:
seq = [1,2,3,4,5]

In [102]:
map(times2,seq)

In [104]:
list(map(times2,seq))

TypeError: 'list' object is not callable

In [105]:
string = 'hello my name is akbar and my email address is akbar.lutfullah@gmail.com'

In [106]:
string.upper()

'HELLO MY NAME IS AKBAR AND MY EMAIL ADDRESS IS AKBAR.LUTFULLAH@GMAIL.COM'

In [108]:
string.lower()

'hello my name is akbar and my email address is akbar.lutfullah@gmail.com'

In [109]:
string.capitalize()

'Hello my name is akbar and my email address is akbar.lutfullah@gmail.com'

In [110]:
string.split()

['hello',
 'my',
 'name',
 'is',
 'akbar',
 'and',
 'my',
 'email',
 'address',
 'is',
 'akbar.lutfullah@gmail.com']

In [117]:
print(string.split('@')[0][0:5])

hello

In [122]:
d = {'key1': 'value 1', 'key2': 'value 2'}

In [123]:
d

{'key1': 'value 1', 'key2': 'value 2'}

In [127]:
d.keys()

dict_keys(['key1', 'key2'])

In [128]:
d.values()

dict_values(['value 1', 'value 2'])

In [129]:
d['key1']

'value 1'

In [130]:
import numpy as np

In [132]:
my_list = [1,2,3]

In [133]:
np.array(my_list)

array([1, 2, 3])

In [134]:
my_matrix = [[1,2,3], [3,4,5], [6,7,8]]

In [135]:
my_matrix

[[1, 2, 3], [3, 4, 5], [6, 7, 8]]

In [136]:
np.array(my_matrix)

array([[1, 2, 3],
       [3, 4, 5],
       [6, 7, 8]])

In [137]:
arr = np.arange(30)

In [138]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29])

In [139]:
arr2 = np.arange(0,30,5)

In [140]:
arr2

array([ 0,  5, 10, 15, 20, 25])

In [143]:
np.linspace(0,30,5)

array([ 0. ,  7.5, 15. , 22.5, 30. ])

In [145]:
x = np.random.rand(5)

In [146]:
x

array([0.66755387, 0.80140691, 0.63208402, 0.08347241, 0.02205074])

In [148]:
print(x)
print(x)
print(x)
print(x)

[0.66755387 0.80140691 0.63208402 0.08347241 0.02205074]
[0.66755387 0.80140691 0.63208402 0.08347241 0.02205074]
[0.66755387 0.80140691 0.63208402 0.08347241 0.02205074]
[0.66755387 0.80140691 0.63208402 0.08347241 0.02205074]

In [149]:
np.random.rand(10,10)

array([[0.75957601, 0.72945206, 0.53780345, 0.81263909, 0.53143343,
        0.10586898, 0.83674748, 0.97633707, 0.4915533 , 0.16565324],
       [0.43657231, 0.63397265, 0.78210541, 0.95023658, 0.45464759,
        0.8424628 , 0.67486758, 0.49469151, 0.86266849, 0.73044641],
       [0.04016198, 0.59679125, 0.56673626, 0.39537817, 0.5079187 ,
        0.1590797 , 0.86457419, 0.51139352, 0.80747768, 0.11747706],
       [0.02754315, 0.46228209, 0.17275523, 0.18807258, 0.11087196,
        0.68965221, 0.34864251, 0.56878869, 0.05878608, 0.38627715],
       [0.4436095 , 0.85758923, 0.48582234, 0.54356601, 0.44579994,
        0.10069901, 0.09493626, 0.5657651 , 0.23027917, 0.94467909],
       [0.35576504, 0.92715302, 0.31839052, 0.38329658, 0.55238205,
        0.62092219, 0.94784231, 0.9564064 , 0.02352368, 0.80805408],
       [0.09864968, 0.96681849, 0.3137782 , 0.41776337, 0.37849299,
        0.9019362 , 0.07419112, 0.28828816, 0.44823844, 0.58955042],
       [0.8180596 , 0.75314925, 0.51369593, 0.37141354, 0.21868544,
        0.10640173, 0.27326346, 0.37910141, 0.68338026, 0.38013412],
       [0.90253354, 0.53535226, 0.83598356, 0.37260748, 0.9860218 ,
        0.83701102, 0.90388811, 0.41197766, 0.63993266, 0.68652056],
       [0.85697116, 0.36529617, 0.50460201, 0.19518232, 0.20435017,
        0.64485043, 0.5207689 , 0.35088081, 0.8701799 , 0.61827969]])

In [150]:
np.random.randint(1,100)

17

In [151]:
np.random.randint(1,100,2)

array([37, 85])

In [157]:
y = np.random.randint(1,1000,25)

In [158]:
y

array([747, 916, 704, 681, 188, 979, 400, 363, 689, 829, 231, 137, 404,
       410, 681, 954, 974, 811, 179, 758, 819, 136, 487, 302, 838])

In [159]:
y.reshape(5,5)

array([[747, 916, 704, 681, 188],
       [979, 400, 363, 689, 829],
       [231, 137, 404, 410, 681],
       [954, 974, 811, 179, 758],
       [819, 136, 487, 302, 838]])

In [160]:
y.max()

979

In [161]:
y.min()

136

In [162]:
y.argmax()

5

In [163]:
y.argmin()

21

In [164]:
import numpy as np
import pandas as pd

In [172]:
d = {'k1':'value', 'k2': 50}
my_list = [7,8,6]
arr = np.array([1,10,1])
labels = ['a', 'b', 'c']

In [173]:
pd.Series(data = d)

k1    value
k2       50
dtype: object

In [174]:
pd.Series(data = my_list)

0    7
1    8
2    6
dtype: int64

In [175]:
pd.Series(data = arr)

0     1
1    10
2     1
dtype: int32

In [176]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [177]:
pd.Series(data = my_list, index = labels)

a    7
b    8
c    6
dtype: int64

In [178]:
ser1 = pd.Series([1,2,3,4], ['UK', 'USA', 'UAE', 'PAKISTAN'])

In [179]:
ser1

UK          1
USA         2
UAE         3
PAKISTAN    4
dtype: int64

In [180]:
ser1['UAE']

3

In [182]:
from numpy.random import randn
np.random.seed(101)

In [187]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [188]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [189]:
df['Y']

A   -0.376519
B   -0.031160
C    0.187125
D    0.961458
E   -1.046780
Name: Y, dtype: float64

In [207]:
from numpy.random import rand
UFC_DF = pd.DataFrame(rand(5,4), index = 'Mcgregor-Nurmagomadov-Ferguson-Porier-Hooker'.split('-'), columns =  'win/lose ratio-takedown defence per fight-% of significant strikes landed per fight-% of takedowns per fight'.split('-'))

In [208]:
UFC_DF

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight,% of takedowns per fight
Mcgregor,0.917477,0.603498,0.454420,0.313479
Nurmagomadov,0.380982,0.642812,0.806533,0.130528
Ferguson,0.730565,0.005438,0.650661,0.453049
Porier,0.200645,0.631129,0.017791,0.838551
Hooker,0.525546,0.370938,0.425750,0.265095

In [213]:
UFC_DF['win/lose ratio'].max()

0.9174772009169982

In [214]:
UFC_DF.drop('% of takedowns per fight', axis = 1, inplace = True)

In [215]:
UFC_DF

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Mcgregor,0.917477,0.603498,0.454420
Nurmagomadov,0.380982,0.642812,0.806533
Ferguson,0.730565,0.005438,0.650661
Porier,0.200645,0.631129,0.017791
Hooker,0.525546,0.370938,0.425750

In [217]:
UFC_DF.drop('Hooker', axis = 0, inplace = True)

In [218]:
UFC_DF

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Mcgregor,0.917477,0.603498,0.454420
Nurmagomadov,0.380982,0.642812,0.806533
Ferguson,0.730565,0.005438,0.650661
Porier,0.200645,0.631129,0.017791

In [222]:
UFC_DF.iloc[3]

win/lose ratio                               0.200645
takedown defence per fight                   0.631129
% of significant strikes landed per fight    0.017791
Name: Porier, dtype: float64

In [224]:
UFC_DF.loc['Porier']

win/lose ratio                               0.200645
takedown defence per fight                   0.631129
% of significant strikes landed per fight    0.017791
Name: Porier, dtype: float64

In [225]:
UFC_DF.loc['Porier', 'takedown defence per fight']

0.6311289773921829

In [226]:
UFC_DF

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Mcgregor,0.917477,0.603498,0.454420
Nurmagomadov,0.380982,0.642812,0.806533
Ferguson,0.730565,0.005438,0.650661
Porier,0.200645,0.631129,0.017791

In [229]:
UFC_DF > 0.5

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Mcgregor,True,True,False
Nurmagomadov,False,True,True
Ferguson,True,False,True
Porier,False,True,False

In [235]:
UFC_DF[UFC_DF > 0.5]

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Mcgregor,0.917477,0.603498,NaN
Nurmagomadov,NaN,0.642812,0.806533
Ferguson,0.730565,NaN,0.650661
Porier,NaN,0.631129,NaN

In [236]:
UFC_DF

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Mcgregor,0.917477,0.603498,0.454420
Nurmagomadov,0.380982,0.642812,0.806533
Ferguson,0.730565,0.005438,0.650661
Porier,0.200645,0.631129,0.017791

In [237]:
new_ind = '1 2 3 4'.split()

In [238]:
UFC_DF['Row Number'] = new_ind

In [246]:
UFC_DF

,win/lose ratio,takedown defence per fight,% of significant strikes landed per fight
Row Number,,,
1,0.917477,0.603498,0.454420
2,0.380982,0.642812,0.806533
3,0.730565,0.005438,0.650661
4,0.200645,0.631129,0.017791

In [247]:
# index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,3,4]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

TypeError: 'list' object is not callable

In [248]:
import numpy as np
import pandas as pd

In [249]:
df = pd.DataFrame({'A': [1,2,np.nan], 'B': [5,np.nan,np.nan], 'C':[1,2,3]})

In [250]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [251]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [252]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [255]:
df.dropna( thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [256]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [257]:
df.fillna(value = 'Hello')

       A      B  C
0      1      5  1
1      2  Hello  2
2  Hello  Hello  3

In [258]:
df['B'].fillna(value= df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [265]:
# create dataframe
data = {'Company': ['Goog', 'Goog', 'MSFT', 'MSFT', 'FB', 'FB'], 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'], 'Sales': [200,150,340,123,243,340]}

In [266]:
df = pd.DataFrame(data)

In [267]:
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    150
2    MSFT      Amy    340
3    MSFT  Vanessa    123
4      FB     Carl    243
5      FB    Sarah    340

In [269]:
df.groupby('Company')

In [270]:
by_comp = df.groupby('Company')

In [271]:
by_comp.mean()

         Sales
Company
FB       291.5
Goog     175.0
MSFT     231.5

In [272]:
df.groupby('Company').mean()

         Sales
Company
FB       291.5
Goog     175.0
MSFT     231.5

In [273]:
by_comp.std()

              Sales
Company
FB        68.589358
Goog      35.355339
MSFT     153.442172

In [274]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
Goog     Charlie    150
MSFT         Amy    123

In [275]:
by_comp.count()

         Person  Sales
Company
FB            2      2
Goog          2      2
MSFT          2      2

In [276]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  291.5   68.589358  243.0  267.25  291.5  315.75  340.0
Goog      2.0  175.0   35.355339  150.0  162.50  175.0  187.50  200.0
MSFT      2.0  231.5  153.442172  123.0  177.25  231.5  285.75  340.0

In [277]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3'], 'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}, index = [0,1,2,3])

In [278]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 'B': ['B4', 'B5', 'B6', 'B7'], 'C': ['C4', 'C5', 'C6', 'C7'], 'D': ['D4', 'D5', 'D6', 'D7']}, index = [4,5,6,7])

In [279]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'], 'B': ['B8', 'B9', 'B10', 'B11'], 'C': ['C8', 'C9', 'C10', 'C11'], 'D': ['D8', 'D9', 'D10', 'D11']}, index = [8,9,10,11])

In [280]:
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    150
2    MSFT      Amy    340
3    MSFT  Vanessa    123
4      FB     Carl    243
5      FB    Sarah    340

In [281]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [282]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [283]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [285]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [286]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [287]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3'] })

In [288]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [291]:
df = pd.DataFrame({'col': [1,2,3,4], 'col2': [3,4,3,6], 'col3': [7,8,9,10]})

In [292]:
df.head()

   col  col2  col3
0    1     3     7
1    2     4     8
2    3     3     9
3    4     6    10

In [293]:
df['col2'].unique()

array([3, 4, 6], dtype=int64)

In [294]:
df['col2'].nunique()

3

In [295]:
df['col2'].value_counts()

3    2
6    1
4    1
Name: col2, dtype: int64

In [301]:
new_df = df[(df['col'] > 1) & (df['col2'] == 3)]

In [302]:
new_df

   col  col2  col3
2    3     3     9

In [303]:
def times2(x):
    return x*2

In [305]:
df['col'].apply(times2)

0    2
1    4
2    6
3    8
Name: col, dtype: int64

In [308]:
df['col2'].sum()

16

In [309]:
del df['col']

In [310]:
df

   col2  col3
0     3     7
1     4     8
2     3     9
3     6    10

In [311]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [312]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [313]:
df.sort_values(by='col3')

   col2  col3
0     3     7
1     4     8
2     3     9
3     6    10

In [314]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [315]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'], 'B': ['one', 'one', 'two', 'two', 'one', 'one'], 'C': ['x', 'y', 'x', 'y', 'x', 'y'], 'D': [1,3,2,5,4,1]}

data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [316]:
df = pd.DataFrame(data = data)

In [319]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [320]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN